In [1]:
import pandas as pd

titanic = pd.read_csv('data/titanic.csv')

In [ ]:
titanic

In [ ]:
titanic.head(3)

In [ ]:
titanic.tail(1)

In [ ]:
titanic.dtypes

In [ ]:
titanic.to_excel('data/titanic.xlsx', sheet_name='passengers', index=False)

In [ ]:
titanic.head()

In [ ]:
titanic.info()

In [ ]:
ages = titanic['Age']
ages.head()

In [2]:
type(titanic['Age'])

pandas.core.series.Series

In [4]:
titanic['Age'].shape

(891,)

In [5]:
age_sex = titanic[["Age", "Sex"]]

In [6]:
age_sex.head()

    Age     Sex
0  22.0    male
1  38.0  female
2  26.0  female
3  35.0  female
4  35.0    male

In [7]:
type(titanic[["Age", "Sex"]])

pandas.core.frame.DataFrame

In [8]:
titanic[["Age", "Sex"]].shape

(891, 2)